src/Enums/КомандыУстройств/КомандыУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КомандыУстройств</name>
  <enumValues>
    <name>Открыть</name>
  </enumValues>
  <enumValues>
    <name>Закрыть</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыУстройств/ТипыУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУстройств</name>
  <enumValues>
    <name>Камера</name>
  </enumValues>
  <enumValues>
    <name>Шлагбаум</name>
  </enumValues>
  <enumValues>
    <name>Теримнал</name>
  </enumValues>
  <enumValues>
    <name>СчитывательКарт</name>
  </enumValues>
  <enumValues>
    <name>ЗаряднаяСтанция</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Устройства/Устройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Устройства</name>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыУстройств</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Команда</name>
      <type>
        <types>EnumRef.КомандыУстройств</types>
      </type>
    </attributes>
    <attributes>
      <name>Отключено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/Устройства/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВыполнитьКоманду(Устройство, Команда) Экспорт
	
	Результат = Истина;
	
	Попытка
		Если Команда = ПредопределенноеЗначение("Перечисление.КомандыУстройств.Открыть") Тогда
			//Результат = ВыполнитьКомандуОткрыть(Устройство, Команда);
		ИначеЕсли Команда = ПредопределенноеЗначение("Перечисление.КомандыУстройств.Закрыть") Тогда 
			//Результат = ВыполнитьКомандуЗакрыть(Устройство, Команда);
		КонецЕсли;
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция Подключить(Устройство) Экспорт
	
	Результат = Истина;
	Если Устройство.Тип = Перечисления.ТипыУстройств.Камера Тогда
		Камеры = Новый Массив;
		Камеры.Добавить(Устройство);
		Результат = СтрокаПоляHTTPВидеоКамер(Камеры, 1);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Команды

Функция ВыполнитьКомандуОткрыть(Устройство, Команда)
	//Устройства.ОтправитьЗапросПоHTTP(ОписаниеУстройства.Адрес,);
КонецФункции

Функция ВыполнитьКомандуЗакрыть(Устройство, Команда)
	//ОтправитьЗапросПоHTTP(ОписаниеУстройства.Адрес,);
КонецФункции

#КонецОбласти

Функция СтрокаПоляHTTPВидеоКамер(Камеры , МаксимумКамер = 4) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 4
	|	Устройства.Адрес КАК АдресУстройства,
	|	Устройства.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Устройства КАК Устройства
	|ГДЕ
	|	Устройства.Ссылка В (&Камеры)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ ПЕРВЫЕ 4", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(МаксимумКамер, "ЧГ=100"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Камеры", Камеры);
	ВыборкаСтрокПодключенияКамеры = Запрос.Выполнить().Выбрать();
	
	АдресУстройства = "";
	
	Номер = 1;
	МассивКамер = Новый Массив;

	Пока ВыборкаСтрокПодключенияКамеры.Следующий() Цикл
		АдресУстройства = ВыборкаСтрокПодключенияКамеры.АдресУстройства;
		Наименование = ВыборкаСтрокПодключенияКамеры.Наименование;
		Номер = Номер + 1;

		МассивКамер.Добавить(Новый Структура("id, name, url", Номер, Наименование, АдресУстройства));
	КонецЦикла;

	Если ПустаяСтрока(АдресУстройства) Тогда
		СтрокаПоля = "<h1>Нет подключенных видеокамер</р1>";
	Иначе
	
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, МассивКамер);

		СтрокаJSON = ЗаписьJSON.Закрыть();
	
		СтрокаПоля = ПолучитьОбщийМакет("HTML_Cameras_HLS").ПолучитьТекст();

		СтрокаПоля = СтрЗаменить(СтрокаПоля, "&source", СтрокаJSON);
		
	КонецЕсли;
	
	Возврат СтрокаПоля;
	
КонецФункции

Функция ОтправитьЗапросПоHTTP(Адрес, ТелоЗапроса = Неопределено) Экспорт
		
	ИнтернетПрокси = Новый ИнтернетПрокси(ИСТИНА);
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		ВызватьИсключение НСтр("ru = '{Х000} Не указан адрес'");
	КонецЕсли;
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Адрес);
	Если СтруктураURI.Схема = "https" Тогда
		СоединениеHTTP = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт,,, ИнтернетПрокси, 10, Новый ЗащищенноеСоединениеOpenSSL(), Ложь);
	Иначе
		СоединениеHTTP = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт,,, ИнтернетПрокси, 10,, Ложь);
	КонецЕсли;
	
	Если ТелоЗапроса = Неопределено Тогда
		ЗапросHTTP = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);
		ОтветHTTP = СоединениеHTTP.ВызватьHTTPМетод("GET", ЗапросHTTP);
	Иначе
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		ЗапросHTTP = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере, Заголовки);
		//ЗапросHTTP.УстановитьТелоИзСтроки(СлужебныйКлиентСервер.ЗначениеВJSON(ТелоЗапроса));
		ОтветHTTP = СоединениеHTTP.ВызватьHTTPМетод("POST", ЗапросHTTP);
	КонецЕсли;

	КодСостояния = ОтветHTTP.КодСостояния;
	ТелоОтветаСтрока = ОтветHTTP.ПолучитьТелоКакСтроку();
	
	Если КодСостояния <> 200 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = '{0055} Код ответа %1: %2'"), КодСостояния, ТелоОтветаСтрока);
	КонецЕсли;
	
	КонтентТип = ОтветHTTP.Заголовки["Content-Type"];
	Если ТипЗнч(КонтентТип) = Тип("Строка") И СтрНайти(КонтентТип, "text/html") Тогда
		Результат = ТелоОтветаСтрока;
	Иначе
		//Результат = СлужебныйКлиентСервер.ЗначениеИзJSON(ТелоОтветаСтрока);
		//Если Не Результат.Success = Истина Тогда
		//	ВызватьИсключение СтрШаблон(НСтр("ru = '{Х000} Ошибка: %1"), Результат.ErrorMessage);
		//КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
